<a href="https://colab.research.google.com/github/ManBilla/Python-for-Machine-Learning-Data-Science/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PANDAS

Pandas is an opensource library built on top of NumPy and it can be used for fast analysis and data cleaning & preparation, data visualization (Pythons version of R dataframe). Works with a wide variety of data sources

In [0]:
conda install pandas

SyntaxError: invalid syntax (<ipython-input-1-182416202f0a>, line 1)

## Pandas Data Types

### 1. Series

* Similar to Numpy Array but Pandas Series can have access labels. i.e. It can be indexed by labels. Because of this, we can do a very fast look up of information like Hash Table or Dictionary

#### Series Basics

In [0]:
import numpy as np

In [0]:
import pandas as pd

In [0]:
#Creating list
labels = ['a','b','c']

#Creating List
my_data = [10,20,30]

#creating Numpy Array
arr = np.array(my_data)

#Creating dictionary
d = {'a':10,'b':20,'c':30}

In [0]:
#Creating a Pandas Series
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [0]:
pd.Series(data=my_data, index =labels)

a    10
b    20
c    30
dtype: int64

In [0]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [0]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [0]:
#pandas series can hold any python object
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

#### Grabbing information from series

In [0]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

In [0]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [0]:
#pulling data from series
ser1['USA']

1

In [0]:
ser1+ser2
#it adds the data for the matched labels. Integers are automatically converted to floats

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### 2. DataFrames

Main workhorse of Pandas

In [0]:
import numpy as np
import pandas as pd

In [0]:
from numpy.random import randn

In [0]:
np.random.seed(101)

In [0]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Here, each column is a series. Dataframe is a set of Series that share the same index

#### Selecting Data from Dataframe

In [0]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

This is a series. You can check by:

In [0]:
type(df['W'])

pandas.core.series.Series

In [0]:
type(df)

pandas.core.frame.DataFrame

In [0]:
#You can also select like you do in SQL (not recommended as you may confuse with methods)
df.W
#One of the methods may get overwritten with column name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [0]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [0]:
#Defining a new column
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [0]:
#df.drop('new') will throw an error as by default axis = 0 (which means index or rows. To indicate columns):
df.drop('new', axis = 1, inplace = True)

However, if you call df, it will still show new row. To make changes permanently to df, use inplace=True as argument

In [0]:
#df.frop can also be used to drop rows
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Reason why rows are 0 and columns are 1 as the DataFrame is nothing but an index marker on top of a Numpy array.

In [0]:
df.shape

(5, 4)

Zero index is for rows and 1 index is for columns

#### Selecting Rows

In [0]:
#There are 2 ways:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

This shows that not only columns but the rows are also Series

In [0]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [0]:
#Subsets of rows and columns: Row B and Columns Y
df.loc['B','Y']

-0.8480769834036315

In [0]:
#subset of multiple rows, columns
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection:

 You can do conditional selection using bracket notation

In [0]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [0]:
df[booldf]
#You can also use df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Shows the rows that meet the criteria only
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
resultdf = df[df['W'] > 0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [0]:
#instead of 2 steps, we can do in 1 step
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

It is efficient to use single step functions as when we use multiple steps, each variable uses some memory

In [0]:
# multiple conditions:
#Below code will result in an error
df[(df['W']> 0) and (df['Y']> 0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

Above error means that the Python will accept single combination of boolean values. Say TRUE and TRUE = TRUE. TRUE and FALSE = FALSE. However, in above case, df['W']>0 has 5 boolean values. So this will throw an error. So when working with multiple boolean values, you need to use & in pandas

In [0]:
df[(df['W']> 0) & (df['Y']> 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#For or, we use pipe operator |
df[(df['W']> 0) | (df['Y']> 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Index

In [0]:
#We can reset the index using reset_index(), which creates a new column - index
# However, it wont affect the original dataframe. To make changes on original dataframe,use inplace = TRUE
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Creating a new index:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [0]:
df['States']=newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [0]:
#Instead of reseting index, we can do set_index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

Again, to make the change to df, use inplace = TRUE

#### Multi index

In [0]:
#Creating a new DataFrame
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
print(hier_index)
#Below function can take a list and create multiple levels
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [0]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

**Read about the above special function**

In [0]:
#To return the first row as series from above aggregation
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [0]:
#We can name the G1, G2 and other indices:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1   -0.925874  1.862864
       2   -1.133817  0.610478
       3    0.386030  2.084019
G2     1   -0.376519  0.230336
       2    0.681209  1.035125
       3   -0.031160  1.939932

In [0]:
#TO call a specific value
df.loc['G2'].loc[3][1]

1.9399323109926203

#### Cross Section

In [0]:
#To grab everything under G1, the other way is using xs (Cross section)
df.xs('G1')

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

The cross section can bypass the levels and filter

In [0]:
#Below code will filter 1's in 'Num' column
df.xs(1, level = 'Num')

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336

## Missing Data Using Pandas

In [0]:
# Creating a dataframe from dictionary
d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [0]:
#Dropping any rows with null values
df.dropna()

     A    B  C
0  1.0  5.0  1

By Specifying axis = 1, we can drop columns instead

In [0]:
# We can specify threshold to drop only if the nuber of na's is greater than threshold
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [0]:
# We can use fillna method to fill the missing values instead
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [0]:
# Instead, filling with mean
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

## Group By

Used for aggregations

In [0]:
#Creating a DataFrame
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [0]:
#This command groups by the column we gave and then stores it at a certain memory location
df.groupby('Company')

In [0]:
byComp = df.groupby('Company')

In [0]:
#The below aggregate functions will ignore any non-numeric columns
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [0]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [0]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [0]:
#Filtering after grouping
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [0]:
#We can call all of above steps in 1 line
df.groupby('Company').sum().loc['FB']

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [0]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [0]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [0]:
# We can use describe to get everything at once
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [0]:
#You can transpose the results using this
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining and Concatenating

In [0]:
#Creating the dataset
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [0]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [0]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [0]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Prereq is that the axes should be same

In [0]:
#Passing the dataframes into a list
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [0]:
#use axis =1 if you want to concat along rows
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merge

In [0]:
#Merging using Keys (Like inner join SQL)
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [0]:
pd.merge(left,right,how ='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In this way, you can create left, right, outer joins

## Joining

Way of joining 2 different dataframes into a single dataframe. Same as merge except that the keys to merge are on index instead of a separate column

In [0]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [0]:
#Automatically uses inner join
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Operations

In [0]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [0]:
#Finding Unique values in the dataframe
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [0]:
# To Check the number of unique values instead either use len(array....) or..
df['col2'].nunique()

3

In [0]:
#value Counts
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Apply Method

In [0]:
# Assume a simple function
def times2(x):
    return x*2

In [0]:
#If we want to sum the elements, we can just use .sum method. However, what if we want to use our function on each element? 
#Apply method broadcasts the function to each element
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [0]:
#Apply is especially powerful when used with lambda expressions as we don't need to create a function if we are using the function only once. Ex. creating lambda exp. out of times2:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [0]:
#to drop a column
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [0]:
#to get index names of dataframe
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [0]:
#you can also get index
df.index

RangeIndex(start=0, stop=4, step=1)

## Ordering Dataframe

In [0]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Finding Null values

In [0]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Pivot Table

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [0]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

**Learn About this**

# Data Input and Output

Various sources can be used like CSV, Excel, HTML, SQL etc. 
For SQL sqlalchemy library is to be installed
For HTML, BeautifulSoup4, html5lib. lxml are to be installed.

## Reading from CSV

The CSV/excel files need to be in same location. You can check using pwd

In [0]:
pwd

'C:\\Users\\ManojKumarBilla\\Google Drive\\Data Science\\Python DS Udeny'

In [0]:
#Reading CSV
pd.read_csv('6monthsDomestic.csv')

,Domestic Shipments Name,LANE FROM,LANE TO,FREIGHT,DEST STATE,DISTANCE,RATE_PER_MILE,SHIPMENT,SOURCE STATE,TRANSPORT_MODE
0,a0W1W000008Mv2c,"SMYRNA, NY","LOGANSPORT, IN",1750.0,IN,676.0,2.59,444080.0,NY,TL
1,a0W1W000008Mv2d,"SMYRNA, NY","SWEDESBORO, NJ",700.0,NJ,254.0,2.76,443813.0,NY,TL
2,a0W1W000008Mv2e,"TITUSVILLE, PA","ST-EUSTACHE, QC",1700.0,QC,519.0,3.28,443848.0,PA,TL
3,a0W1W000008Mv2f,"TITUSVILLE, PA","TROY, PA",750.0,PA,240.0,3.13,442823.0,PA,TL
4,a0W1W000008Mv2g,"ALLEGANY, NY","LIVERMORE, CA",2710.0,CA,2656.0,1.02,443101.0,NY,INTRMDL
5,a0W1W000008Mv2h,"ALLEGANY, NY","LOGANSPORT, IN",1400.0,IN,482.0,2.90,443915.0,NY,TL
6,a0W1W000008Mv2i,"ALLEGANY, NY","LOGANSPORT, IN",1450.0,IN,482.0,3.01,444425.0,NY,TL
7,a0W1W000008Mv2j,"BOONVILLE, NY","BALLY, PA",935.0,PA,314.0,2.98,444090.0,NY,TL
8,a0W1W000008Mv2k,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,444395.0,NY,TL
9,a0W1W000008Mv2l,"BOONVILLE, NY","CHEEKTOWAGA, NY",600.0,NY,229.0,2.62,444249.0,NY,TL
10,a0W1W000008Mv2m,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444435.0,NY,TL
11,a0W1W000008Mv2n,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444436.0,NY,TL
12,a0W1W000008Mv2o,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444504.0,NY,TL
13,a0W1W000008Mv2p,"CANDOR, NY","TEWKSBURY, MA",900.0,MA,374.0,2.41,444027.0,NY,TL
14,a0W1W000008Mv2q,"CAYUTA, NY","CLEARFIELD, PA",700.0,PA,197.0,3.55,444001.0,NY,TL
15,a0W1W000008MuyS,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442943.0,NY,TL
16,a0W1W000008MuyT,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442944.0,NY,TL
17,a0W1W000008MuyU,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442948.0,NY,TL
18,a0W1W000008MuyV,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442950.0,NY,TL
19,a0W1W000008MuyW,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442951.0,NY,TL
20,a0W1W000008MuyX,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,443218.0,NY,TL
21,a0W1W000008MuyY,"CANTON, NC","ELLIJAY, GA",650.0,GA,146.0,4.45,442967.0,NC,TL
22,a0W1W000008MuyZ,"COVE CITY, NC","BRAINERD, MN",3500.0,MN,1455.0,2.41,442126.0,NC,TL
23,a0W1W000008Muya,"COVE CITY, NC","RICE, MN",3400.0,MN,1406.0,2.42,441304.0,NC,TL
24,a0W1W000008Muyb,"DONALDS, SC","SUWANEE, GA",700.0,GA,123.0,5.69,442362.0,SC,TL
25,a0W1W000008Muyc,"DONALDS, SC","ZEELAND, MI",2450.0,MI,792.0,3.09,441717.0,SC,TL
26,a0W1W000008Muyd,"HUNTERSVILLE, NC","SAYRE, PA",1750.0,PA,613.0,2.85,442465.0,NC,TL
27,a0W1W000008Muye,"HURLEY, WI","LA PORTE, IN",1130.0,IN,475.0,2.38,441366.0,WI,TL
28,a0W1W000008Muyf,"LEITCHFIELD, KY","ST. AUGUSTINE, FL",2300.0,FL,767.0,3.00,442076.0,KY,TL
29,a0W1W000008Muyg,"MARIETTA, OH","BEVERLY, WV",850.0,WV,150.0,5.67,442282.0,OH,TL
...,...,...,...,...,...,...,...,...,...,...
1900,a0W1W000008MuoW,"ALLENSVILLE, PA","TITUSVILLE, PA",600.0,PA,170.0,3.53,438583.0,PA,TL
1901,a0W1W000008MuoX,"BARTOW, WV","LONG BEACH, CA",2587.5,CA,2522.0,1.03,438519.0,WV,INTRMDL
1902,a0W1W000008MuoY,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,438535.0,NY,TL
1903,a0W1W000008MuoZ,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439018.0,NY,TL
1904,a0W1W000008Muoa,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439019.0,NY,TL
1905,a0W1W000008Muob,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439021.0,NY,TL
1906,a0W1W000008Muoc,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439022.0,NY,TL
1907,a0W1W000008Muod,"CANDOR, NY","ACTON, MA",950.0,MA,362.0,2.62,438200.0,NY,TL
1908,a0W1W000008Muoe,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438739.0,NY,TL
1909,a0W1W000008Muof,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438819.0,NY,TL
1910,a0W1W000008Muog,"CAYUTA, NY","AUBURN, AL",1900.0,AL,1016.0,1.87,438799.0,NY,TL
1911,a0W1W000008Muom,"LEITCHFIELD, KY","FORT WORTH, TX",2000.0,TX,805.0,2.48,438715.0,KY,TL
1912,a0W1W000008Muon,"LEITCHFIELD, KY","SCOTT CITY, MO",900.0,MO,263.0,3.42,437529.0,KY,TL
1913,a0W1W000008Muoo,"LEWISTOWN, PA","SMYRNA, NY",700.0,NY,250.0,2.80,438429.0,PA,TL
1914,a0W1W000008Muop,"MARIETTA, OH","VONORE, TN",1600.0,TN,436.0,3.67,438761.0,OH,TL
1915,a0W1W000008Muoq,"MARIETTA, OH","VONORE, TN",1700.0,TN,436.0,3.90,438736.0,OH,TL
1916,a0W1W000008Muor,"MARIETTA, OH","WAYNESBORO, VA",900.0,VA,317.0,2.84,438407.0,OH,TL
1917,a0W1W000008Mup7,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439166.0,NY,TL
1918,a0W1W000008Mup8,"BRATTLEBORO, VT","SMYRNA, NY",750.0,NY,201.0,3.73,438805.0,VT,TL
1919,a0W1W000008Mup9,"BRATTLEBORO, VT","SMYRNA, NY",1100.0,NY,201.0,5.47,438373.0,VT,LTL
1920,a0W1W000008Mup6,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439060.0,NY,TL
1921,a0W1W000008MupA,"CANDOR, NY","NEWBURYPORT, MA",1000.0,MA,403.0,2.48,437712.0,NY,TL
1922,a0W1W000008MupB,"CANDOR, NY","SUGARCREEK, OH",850.0,OH,405.0,2.10,438815.0,NY,TL
1923,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1924,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1925,Domestic Shipments(2/14/2018-->8/14/2018,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1926,"Copyright (c) 2000-2018 salesforce.com, inc. A...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1927,Confidential Information - Do Not Distribute,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1928,Generated By: Micah Bledsoe 8/14/2018 8:31 AM,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1929,Baillie Lumber,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [0]:
df = pd.read_csv('6monthsDomestic.csv')

In [0]:
df.to_csv('My_output', index = False)

In [0]:
pd.read_csv('My_output')

,Domestic Shipments Name,LANE FROM,LANE TO,FREIGHT,DEST STATE,DISTANCE,RATE_PER_MILE,SHIPMENT,SOURCE STATE,TRANSPORT_MODE
0,a0W1W000008Mv2c,"SMYRNA, NY","LOGANSPORT, IN",1750.0,IN,676.0,2.59,444080.0,NY,TL
1,a0W1W000008Mv2d,"SMYRNA, NY","SWEDESBORO, NJ",700.0,NJ,254.0,2.76,443813.0,NY,TL
2,a0W1W000008Mv2e,"TITUSVILLE, PA","ST-EUSTACHE, QC",1700.0,QC,519.0,3.28,443848.0,PA,TL
3,a0W1W000008Mv2f,"TITUSVILLE, PA","TROY, PA",750.0,PA,240.0,3.13,442823.0,PA,TL
4,a0W1W000008Mv2g,"ALLEGANY, NY","LIVERMORE, CA",2710.0,CA,2656.0,1.02,443101.0,NY,INTRMDL
5,a0W1W000008Mv2h,"ALLEGANY, NY","LOGANSPORT, IN",1400.0,IN,482.0,2.90,443915.0,NY,TL
6,a0W1W000008Mv2i,"ALLEGANY, NY","LOGANSPORT, IN",1450.0,IN,482.0,3.01,444425.0,NY,TL
7,a0W1W000008Mv2j,"BOONVILLE, NY","BALLY, PA",935.0,PA,314.0,2.98,444090.0,NY,TL
8,a0W1W000008Mv2k,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,444395.0,NY,TL
9,a0W1W000008Mv2l,"BOONVILLE, NY","CHEEKTOWAGA, NY",600.0,NY,229.0,2.62,444249.0,NY,TL
10,a0W1W000008Mv2m,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444435.0,NY,TL
11,a0W1W000008Mv2n,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444436.0,NY,TL
12,a0W1W000008Mv2o,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444504.0,NY,TL
13,a0W1W000008Mv2p,"CANDOR, NY","TEWKSBURY, MA",900.0,MA,374.0,2.41,444027.0,NY,TL
14,a0W1W000008Mv2q,"CAYUTA, NY","CLEARFIELD, PA",700.0,PA,197.0,3.55,444001.0,NY,TL
15,a0W1W000008MuyS,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442943.0,NY,TL
16,a0W1W000008MuyT,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442944.0,NY,TL
17,a0W1W000008MuyU,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442948.0,NY,TL
18,a0W1W000008MuyV,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442950.0,NY,TL
19,a0W1W000008MuyW,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442951.0,NY,TL
20,a0W1W000008MuyX,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,443218.0,NY,TL
21,a0W1W000008MuyY,"CANTON, NC","ELLIJAY, GA",650.0,GA,146.0,4.45,442967.0,NC,TL
22,a0W1W000008MuyZ,"COVE CITY, NC","BRAINERD, MN",3500.0,MN,1455.0,2.41,442126.0,NC,TL
23,a0W1W000008Muya,"COVE CITY, NC","RICE, MN",3400.0,MN,1406.0,2.42,441304.0,NC,TL
24,a0W1W000008Muyb,"DONALDS, SC","SUWANEE, GA",700.0,GA,123.0,5.69,442362.0,SC,TL
25,a0W1W000008Muyc,"DONALDS, SC","ZEELAND, MI",2450.0,MI,792.0,3.09,441717.0,SC,TL
26,a0W1W000008Muyd,"HUNTERSVILLE, NC","SAYRE, PA",1750.0,PA,613.0,2.85,442465.0,NC,TL
27,a0W1W000008Muye,"HURLEY, WI","LA PORTE, IN",1130.0,IN,475.0,2.38,441366.0,WI,TL
28,a0W1W000008Muyf,"LEITCHFIELD, KY","ST. AUGUSTINE, FL",2300.0,FL,767.0,3.00,442076.0,KY,TL
29,a0W1W000008Muyg,"MARIETTA, OH","BEVERLY, WV",850.0,WV,150.0,5.67,442282.0,OH,TL
...,...,...,...,...,...,...,...,...,...,...
1900,a0W1W000008MuoW,"ALLENSVILLE, PA","TITUSVILLE, PA",600.0,PA,170.0,3.53,438583.0,PA,TL
1901,a0W1W000008MuoX,"BARTOW, WV","LONG BEACH, CA",2587.5,CA,2522.0,1.03,438519.0,WV,INTRMDL
1902,a0W1W000008MuoY,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,438535.0,NY,TL
1903,a0W1W000008MuoZ,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439018.0,NY,TL
1904,a0W1W000008Muoa,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439019.0,NY,TL
1905,a0W1W000008Muob,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439021.0,NY,TL
1906,a0W1W000008Muoc,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439022.0,NY,TL
1907,a0W1W000008Muod,"CANDOR, NY","ACTON, MA",950.0,MA,362.0,2.62,438200.0,NY,TL
1908,a0W1W000008Muoe,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438739.0,NY,TL
1909,a0W1W000008Muof,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438819.0,NY,TL
1910,a0W1W000008Muog,"CAYUTA, NY","AUBURN, AL",1900.0,AL,1016.0,1.87,438799.0,NY,TL
1911,a0W1W000008Muom,"LEITCHFIELD, KY","FORT WORTH, TX",2000.0,TX,805.0,2.48,438715.0,KY,TL
1912,a0W1W000008Muon,"LEITCHFIELD, KY","SCOTT CITY, MO",900.0,MO,263.0,3.42,437529.0,KY,TL
1913,a0W1W000008Muoo,"LEWISTOWN, PA","SMYRNA, NY",700.0,NY,250.0,2.80,438429.0,PA,TL
1914,a0W1W000008Muop,"MARIETTA, OH","VONORE, TN",1600.0,TN,436.0,3.67,438761.0,OH,TL
1915,a0W1W000008Muoq,"MARIETTA, OH","VONORE, TN",1700.0,TN,436.0,3.90,438736.0,OH,TL
1916,a0W1W000008Muor,"MARIETTA, OH","WAYNESBORO, VA",900.0,VA,317.0,2.84,438407.0,OH,TL
1917,a0W1W000008Mup7,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439166.0,NY,TL
1918,a0W1W000008Mup8,"BRATTLEBORO, VT","SMYRNA, NY",750.0,NY,201.0,3.73,438805.0,VT,TL
1919,a0W1W000008Mup9,"BRATTLEBORO, VT","SMYRNA, NY",1100.0,NY,201.0,5.47,438373.0,VT,LTL
1920,a0W1W000008Mup6,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439060.0,NY,TL
1921,a0W1W000008MupA,"CANDOR, NY","NEWBURYPORT, MA",1000.0,MA,403.0,2.48,437712.0,NY,TL
1922,a0W1W000008MupB,"CANDOR, NY","SUGARCREEK, OH",850.0,OH,405.0,2.10,438815.0,NY,TL
1923,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1924,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1925,Domestic Shipments(2/14/2018-->8/14/2018,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1926,"Copyright (c) 2000-2018 salesforce.com, inc. A...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1927,Confidential Information - Do Not Distribute,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1928,Generated By: Micah Bledsoe 8/14/2018 8:31 AM,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1929,Baillie Lumber,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Reading From Excel

There might be errors when the Excel file being read has macros/formulae.
May need to install xlrd library if not installed.

In [0]:
pd.read_excel('Excel_sample.xslx',sheetname = 'Sheet1')

#Writing to Excel
df.to_excel('Excel_sample2.xslx',sheet_name='newSheet')

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_sample.xslx'

## Reading from HTML

In [0]:
data = pd.read_html('https://www.google.cpm')

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [0]:
#the data read is list. Every table for example is converted to dataframe
data[0].head()

KeyError: 0

**Check this Once. Try with link given**

## Reading from SQL

Pandas is not great for reading from SQL as there can be different flavors of SQL like postgresql, mysql etc. For each, different libraries are needed.

In [0]:
from sqlalchemy import create_engine_engine

In [0]:
#this line of code will create a very small SQLite engine running in memory
engine = create_engine('sqlite:///:memory:')

In [0]:
#Creating a table and writing to engine (connection)
df.to_sql('my_table',engine)

ValueError: Table 'my_table' already exists.

In [0]:
#reading back from the sql db

sqldf = pd.read_sql('my_table',con=engine)
sqldf

,index,Domestic Shipments Name,LANE FROM,LANE TO,FREIGHT,DEST STATE,DISTANCE,RATE_PER_MILE,SHIPMENT,SOURCE STATE,TRANSPORT_MODE
0,0,a0W1W000008Mv2c,"SMYRNA, NY","LOGANSPORT, IN",1750.0,IN,676.0,2.59,444080.0,NY,TL
1,1,a0W1W000008Mv2d,"SMYRNA, NY","SWEDESBORO, NJ",700.0,NJ,254.0,2.76,443813.0,NY,TL
2,2,a0W1W000008Mv2e,"TITUSVILLE, PA","ST-EUSTACHE, QC",1700.0,QC,519.0,3.28,443848.0,PA,TL
3,3,a0W1W000008Mv2f,"TITUSVILLE, PA","TROY, PA",750.0,PA,240.0,3.13,442823.0,PA,TL
4,4,a0W1W000008Mv2g,"ALLEGANY, NY","LIVERMORE, CA",2710.0,CA,2656.0,1.02,443101.0,NY,INTRMDL
5,5,a0W1W000008Mv2h,"ALLEGANY, NY","LOGANSPORT, IN",1400.0,IN,482.0,2.90,443915.0,NY,TL
6,6,a0W1W000008Mv2i,"ALLEGANY, NY","LOGANSPORT, IN",1450.0,IN,482.0,3.01,444425.0,NY,TL
7,7,a0W1W000008Mv2j,"BOONVILLE, NY","BALLY, PA",935.0,PA,314.0,2.98,444090.0,NY,TL
8,8,a0W1W000008Mv2k,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,444395.0,NY,TL
9,9,a0W1W000008Mv2l,"BOONVILLE, NY","CHEEKTOWAGA, NY",600.0,NY,229.0,2.62,444249.0,NY,TL
10,10,a0W1W000008Mv2m,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444435.0,NY,TL
11,11,a0W1W000008Mv2n,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444436.0,NY,TL
12,12,a0W1W000008Mv2o,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,444504.0,NY,TL
13,13,a0W1W000008Mv2p,"CANDOR, NY","TEWKSBURY, MA",900.0,MA,374.0,2.41,444027.0,NY,TL
14,14,a0W1W000008Mv2q,"CAYUTA, NY","CLEARFIELD, PA",700.0,PA,197.0,3.55,444001.0,NY,TL
15,15,a0W1W000008MuyS,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442943.0,NY,TL
16,16,a0W1W000008MuyT,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442944.0,NY,TL
17,17,a0W1W000008MuyU,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442948.0,NY,TL
18,18,a0W1W000008MuyV,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442950.0,NY,TL
19,19,a0W1W000008MuyW,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,442951.0,NY,TL
20,20,a0W1W000008MuyX,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,443218.0,NY,TL
21,21,a0W1W000008MuyY,"CANTON, NC","ELLIJAY, GA",650.0,GA,146.0,4.45,442967.0,NC,TL
22,22,a0W1W000008MuyZ,"COVE CITY, NC","BRAINERD, MN",3500.0,MN,1455.0,2.41,442126.0,NC,TL
23,23,a0W1W000008Muya,"COVE CITY, NC","RICE, MN",3400.0,MN,1406.0,2.42,441304.0,NC,TL
24,24,a0W1W000008Muyb,"DONALDS, SC","SUWANEE, GA",700.0,GA,123.0,5.69,442362.0,SC,TL
25,25,a0W1W000008Muyc,"DONALDS, SC","ZEELAND, MI",2450.0,MI,792.0,3.09,441717.0,SC,TL
26,26,a0W1W000008Muyd,"HUNTERSVILLE, NC","SAYRE, PA",1750.0,PA,613.0,2.85,442465.0,NC,TL
27,27,a0W1W000008Muye,"HURLEY, WI","LA PORTE, IN",1130.0,IN,475.0,2.38,441366.0,WI,TL
28,28,a0W1W000008Muyf,"LEITCHFIELD, KY","ST. AUGUSTINE, FL",2300.0,FL,767.0,3.00,442076.0,KY,TL
29,29,a0W1W000008Muyg,"MARIETTA, OH","BEVERLY, WV",850.0,WV,150.0,5.67,442282.0,OH,TL
...,...,...,...,...,...,...,...,...,...,...,...
1900,1900,a0W1W000008MuoW,"ALLENSVILLE, PA","TITUSVILLE, PA",600.0,PA,170.0,3.53,438583.0,PA,TL
1901,1901,a0W1W000008MuoX,"BARTOW, WV","LONG BEACH, CA",2587.5,CA,2522.0,1.03,438519.0,WV,INTRMDL
1902,1902,a0W1W000008MuoY,"BOONVILLE, NY","BRIDGEPORT, CT",800.0,CT,287.0,2.79,438535.0,NY,TL
1903,1903,a0W1W000008MuoZ,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439018.0,NY,TL
1904,1904,a0W1W000008Muoa,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439019.0,NY,TL
1905,1905,a0W1W000008Muob,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439021.0,NY,TL
1906,1906,a0W1W000008Muoc,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439022.0,NY,TL
1907,1907,a0W1W000008Muod,"CANDOR, NY","ACTON, MA",950.0,MA,362.0,2.62,438200.0,NY,TL
1908,1908,a0W1W000008Muoe,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438739.0,NY,TL
1909,1909,a0W1W000008Muof,"CANDOR, NY","MIFFLINBURG, PA",500.0,PA,130.0,3.85,438819.0,NY,TL
1910,1910,a0W1W000008Muog,"CAYUTA, NY","AUBURN, AL",1900.0,AL,1016.0,1.87,438799.0,NY,TL
1911,1911,a0W1W000008Muom,"LEITCHFIELD, KY","FORT WORTH, TX",2000.0,TX,805.0,2.48,438715.0,KY,TL
1912,1912,a0W1W000008Muon,"LEITCHFIELD, KY","SCOTT CITY, MO",900.0,MO,263.0,3.42,437529.0,KY,TL
1913,1913,a0W1W000008Muoo,"LEWISTOWN, PA","SMYRNA, NY",700.0,NY,250.0,2.80,438429.0,PA,TL
1914,1914,a0W1W000008Muop,"MARIETTA, OH","VONORE, TN",1600.0,TN,436.0,3.67,438761.0,OH,TL
1915,1915,a0W1W000008Muoq,"MARIETTA, OH","VONORE, TN",1700.0,TN,436.0,3.90,438736.0,OH,TL
1916,1916,a0W1W000008Muor,"MARIETTA, OH","WAYNESBORO, VA",900.0,VA,317.0,2.84,438407.0,OH,TL
1917,1917,a0W1W000008Mup7,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439166.0,NY,TL
1918,1918,a0W1W000008Mup8,"BRATTLEBORO, VT","SMYRNA, NY",750.0,NY,201.0,3.73,438805.0,VT,TL
1919,1919,a0W1W000008Mup9,"BRATTLEBORO, VT","SMYRNA, NY",1100.0,NY,201.0,5.47,438373.0,VT,LTL
1920,1920,a0W1W000008Mup6,"BOONVILLE, NY","SMYRNA, NY",475.0,NY,80.0,5.94,439060.0,NY,TL
1921,1921,a0W1W000008MupA,"CANDOR, NY","NEWBURYPORT, MA",1000.0,MA,403.0,2.48,437712.0,NY,TL
1922,1922,a0W1W000008MupB,"CANDOR, NY","SUGARCREEK, OH",850.0,OH,405.0,2.10,438815.0,NY,TL
1923,1923,None,None,None,NaN,None,NaN,NaN,NaN,None,None
1924,1924,None,None,None,NaN,None,NaN,NaN,NaN,None,None
1925,1925,Domestic Shipments(2/14/2018-->8/14/2018,None,None,NaN,None,NaN,NaN,NaN,None,None
1926,1926,"Copyright (c) 2000-2018 salesforce.com, inc. A...",None,None,NaN,None,NaN,NaN,NaN,None,None
1927,1927,Confidential Information - Do Not Distribute,None,None,NaN,None,NaN,NaN,NaN,None,None
1928,1928,Generated By: Micah Bledsoe 8/14/2018 8:31 AM,None,None,NaN,None,NaN,NaN,NaN,None,None
1929,1929,Baillie Lumber,None,None,NaN,None,NaN,NaN,NaN,None,None